AlfredKrutina/chess_esp32_c6_devkit/components/matrix_task/matrix_task.c
/**
 * @file matrix_task.c
 * @brief Matrix Scanning Task - Detekce fyzickych figurek na sachovnici
 *
 * @details
 * =============================================================================
 * CO TENTO SOUBOR DELA?
 * =============================================================================
 *
 * Tento task skenujesachovnici a detekuje pohyb figurek:
 * 1. Multiplexovany sken 8x8 matrix (Jazyckove kontakty pod kazdym polem)
 * 2. Debouncing (ignoruje "zatraseni" pri zvedani/kladeni figurky)
 * 3. Detekce UP/DN udalosti (figurka zvedla/polozila)
 * 4. Poslani tahu do game_task (kdyz detekuje kompletni tah)
 * 5. Error detection (spatny sled eventu)
 *
 * =============================================================================
 * JAK TO FUNGUJE?
 * =============================================================================
 *
 * MULTIPLEX SCANNING:
 * - Aktivuj radek 0 (row select GPIO)
 * - Cti 8 sloupcu (column read GPIO)
 * - Uloz stav -> matrix_state[0][0-7]
 * - Deaktivuj radek 0
 * - Opakuj pro radky 1-7
 * - Celkovy cas: ~10ms (cely sken)
 *
 * DEBOUNCING:
 * - Kazdy senzor musi byt stabilni 3 skeny za sebou
 * - Pak teprve detekujeme zmenu (UP/DN)
 * - Ignoruje "chveni" pri manipulaci
 *
 * PIECE TRACKING:
 * - Stav: IDLE -> PIECE_UP -> PIECE_DN -> IDLE
 * - UP na e2 -> cekame na DN nekde jinde
 * - DN na e4 -> tah e2-e4 detekovan!
 * - Posli do game_command_queue
 *
 * =============================================================================
 * KOMUNIKACE (FIFOS)
 * =============================================================================
 *
 * FRONTA - Posilame detkovane tahy:
 * - game_command_queue -> Poslani tahu typu GAME_CMD_MOVE_DETECTED
 *
 * ZADNE MUTEXY - Task je read-only (jen cte GPIO)
 *
 * =============================================================================
 * HARDWARE (GPIO MAPPING)
 * =============================================================================
 *
 * ROW SELECT (8 pinu, aktivni LOW):
 * - GPIO 10-17: Vyber radku sachovnice
 *
 * COLUMN READ (8 pinu, pull-up):
 * - GPIO 18-25: Cteni Jazyckovych kontaktu (Reed switches)
 *
 * Jazyckove kontakty: Detekuji magnet ve figurce
 * - LOW = Figurka pritomna
 * - HIGH = Prazdne pole
 *
 * =============================================================================
 * KRITICKA PRAVIDLA
 * =============================================================================
 *
 * @warning CO SE NESMI DELAT:
 *
 * 1. NIKDY nemaz debounce delay!
 *    Bez debounce bude detekovat "chveni" jako desitky eventu
 *
 * 2. NIKDY neskrацуй scan interval pod 10ms!
 *    GPIO multiplex potrebuje cas na ustabilizovani
 *
 * 3. NIKDY neposilej tah primo do game_execute_move!
 *    ❌ game_execute_move(&move);  // Pristup z jineho tasku!
 *    ✅ xQueueSend(game_command_queue, &cmd, ...);  // Pres frontu
 *
 * 4. VZDY kontroluj queue overflow!
 *    Pokud game_task je zahlcen, fronta se muze naplnit
 *
 * =============================================================================
 * TABLE OF CONTENTS
 * =============================================================================
 *
 * Sekce 1:  GPIO Init ............................ radek 80
 * Sekce 2:  Matrix Scanning ...................... radek 200
 * Sekce 3:  Debouncing Logic ..................... radek 350
 * Sekce 4:  Event Detection ...................... radek 500
 * Sekce 5:  Main Matrix Task ..................... radek 750
 *
 * =============================================================================
 *
 * @author Alfred Krutina
 * @version 2.4
 * @date 2025-12-22
 *
 * @note
 * - Task priorita: 6 (vyssi nez game - realtime  detection)
 * - Scan interval: 10ms
 * - Debounce: 3 skeny (30ms)
 *
 * @see game_task.c - Prijima detkovane tahy
 */

#include "sdkconfig.h"
#include "matrix_task.h"
#include "hall_i2c_matrix.h"
#if CONFIG_CHESS_STM32_I2C_BL_ENABLE
#include "stm32_i2c_bl.h"
#endif
#include "game_task.h"
#include "../ha_light_task/include/ha_light_task.h"
#include "chess_types.h"
#include "driver/gpio.h"
#include "esp_log.h"
#include "esp_system.h"
#include "esp_task_wdt.h"
#include "esp_timer.h"
// #include "freertos/FreeRTOS.h" // Unused
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "freertos/timers.h"
#include "freertos_chess.h"
#include <ctype.h>
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

// External function to report activity (implemented in main.c)
extern void demo_report_activity(void);

static const char *TAG = "MATRIX_TASK";

// ============================================================================
// WDT WRAPPER FUNCTIONS
// ============================================================================

/**
 * @brief Bezpecny reset WDT s logovanim WARNING misto ERROR pro
 * ESP_ERR_NOT_FOUND
 *
 * @return ESP_OK pokud uspesne, ESP_ERR_NOT_FOUND pokud task neni registrovany
 * (WARNING pouze)
 *
 * @details
 * Funkce je pouzivana pro bezpecny reset watchdog timeru behem matrix operaci.
 * Zabranuje chybam pri startupu kdy task jeste neni registrovany.
 */
static esp_err_t matrix_task_wdt_reset_safe(void) {
  esp_err_t ret = esp_task_wdt_reset();

  if (ret == ESP_ERR_NOT_FOUND) {
    // Logovat jako WARNING misto ERROR - task jeste neni registrovany
    ESP_LOGW(
        TAG,
        "WDT reset: task not registered yet (this is normal during startup)");
    return ESP_OK; // Povazovat za uspech pro nase ucely
  } else if (ret != ESP_OK) {
    ESP_LOGE(TAG, "WDT reset failed: %s", esp_err_to_name(ret));
    return ret;
  }

  return ESP_OK;
}

// ============================================================================
// LOKALNI PROMENNE A KONSTANTY
// ============================================================================

// Stav matice
static uint8_t matrix_state[64] = {0};    // Aktualni stav matice
static uint8_t matrix_previous[64] = {0}; // Predchozi stav matice
static uint8_t matrix_changes[64] = {0};  // Detekce zmen

// Stav tasku
static bool task_running = false;
static bool simulation_mode = false; // Zmeneno na false pro realny hardware
bool matrix_scanning_enabled = true; // Skenovani matice povoleno ve vychozim
                                     // nastaveni (extern pro timer callback)

// Stav skenovani
static uint8_t current_row = 0;
static uint32_t last_scan_time = 0;
static uint32_t scan_count = 0;

// Detekce tahu
static uint8_t last_piece_lifted = 255; // Zadna figurka
static uint8_t last_piece_placed = 255; // Zadna figurka
static uint32_t move_detection_timeout = 0;
static bool matrix_guard_mode_active = false;
static uint8_t matrix_guard_expected_state[64] = {0};

// Vzory matice pro simulaci
static const uint8_t simulation_patterns[][64] = {
    // Pattern 0: Empty board
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
     0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
     0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},

    // Pattern 1: Starting position
    {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0,
     0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
     0, 0, 0, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2},

    // Pattern 2: Mid-game position
    {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0,
     0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
     0, 0, 0, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2}};

static uint8_t current_pattern = 1; // Zacit s vzorem 1

// ============================================================================
// FUNKCE PRO SKENOVANI MATICE
// ============================================================================

/**
 * @brief Skenuje jeden radek matice (interni funkce bez mutexu)
 *
 * Tato funkce skenuje jeden radek 8x8 reed switch matice. Pred skenovanim
 * nastavi vsechny row piny na HIGH (neaktivni), pak aktivuje aktualni radek
 * nastavenim na LOW, ceka 5 ms pro stabilizaci signalu, precte column piny
 * a nastavi radek zpet na HIGH.
 *
 * @param row Cislo radku (0-7)
 *
 * @details
 * Hardware logika:
 * - Row piny jsou DRIVE (vystupni) - aktivne nastavujes stav
 * - Column piny jsou SENSE (vstupni s pull-up) - ctes je
 * - Aktivni row = LOW (stahne column pin na LOW pokud je figurka/reed switch
 * uzavreny)
 * - Neaktivni row = HIGH (column pin zustane HIGH pokud neni figurka)
 *
 * Pred aktivaci aktualniho radku se vsechny row piny nastavi
 * na HIGH. Toto zajistuje, ze ostatni row piny nebudou interferovat s ctenim
 * column pinu. Bez tohoto by figurkami v jednom sloupci na ruznych radcich
 * mohly zpusobit falesnou detekci (pokud by row pin zustal LOW, column pin
 * by byl LOW i kdyz skenujeme jiny radek).
 *
 * Stabilizacni cekani: Po aktivaci row pinu na LOW se ceka 5 ms pro spravne
 * ustaleni napetoveho stavu. Bez tohoto cekani by mohlo dochazet k nespravnemu
 * cteni stavu column pinu kvuli elektromagnetickym interferencim a kapacitnim
 * efektum.
 *
 * @note Volajici musi drzet matrix_mutex pred volanim teto funkce
 */
static void matrix_scan_row_internal(uint8_t row) {
  if (row >= 8)
    return;

#if CONFIG_CHESS_MATRIX_INPUT_I2C_HALL
  (void)row;
  return;
#else

  // IMPROVED: Přepni všechny řádky na INPUT před aktivací aktuálního řádku
  // Toto je bezpečnější než jen nastavení HIGH, protože zabraňuje konfliktům
  // při přepínání mezi řádky (jako v referenčním kódu)
  for (int i = 0; i < 8; i++) {
    gpio_config_t io_conf = {.pin_bit_mask = (1ULL << matrix_row_pins[i]),
                             .mode = GPIO_MODE_INPUT,
                             .pull_up_en = GPIO_PULLUP_DISABLE,
                             .pull_down_en = GPIO_PULLDOWN_DISABLE,
                             .intr_type = GPIO_INTR_DISABLE};
    gpio_config(&io_conf);
  }

