AlfredKrutina/chess_esp32_c6_devkit/components/matrix_task/matrix_task.c
  // IMPROVED: Použij esp_rom_delay_us místo vTaskDelay (timer callback
  // context)
  extern void esp_rom_delay_us(uint32_t us);
  esp_rom_delay_us(20); // 20us settling time (reduced from 1ms)

  // Nastav aktuální řádek na OUTPUT a LOW (aktivace)
  // Toto stáhne column pin na LOW pokud je na tomto křížení figurka (reed
  // switch uzavřený)
  gpio_config_t io_conf = {.pin_bit_mask = (1ULL << matrix_row_pins[row]),
                           .mode = GPIO_MODE_OUTPUT,
                           .pull_up_en = GPIO_PULLUP_DISABLE,
                           .pull_down_en = GPIO_PULLDOWN_DISABLE,
                           .intr_type = GPIO_INTR_DISABLE};
  gpio_config(&io_conf);
  gpio_set_level(matrix_row_pins[row], 0); // LOW = aktivní

  // GPIO settling time: 200us for signal stabilization (long wires support)
  // For digital signals with long cables (capacitance), we need more time
  // for the signal to fall to logic LOW (grounding).
  esp_rom_delay_us(200);

  // Read all column pins for this row
  // Column piny mají pull-up, takže bez figury budou HIGH
  // Pokud je figurka (reed switch uzavřený), column pin bude LOW
  
  // Read all column pins for this row
  // Column piny mají pull-up, takže bez figury budou HIGH
  // Pokud je figurka (reed switch uzavřený), column pin bude LOW
  
  for (int col = 0; col < 8; col++) {
    // Invert column index to fix GPIO physical wiring (H→A instead of
    // A→H) GPIO pins are wired in reverse: pin 0 = column H, pin 7 = column A
    // So we invert: col 0 → index 7 (H), col 1 → index 6 (G), ..., col 7 →
    // index 0 (A)
    int inverted_col = 7 - col;
    int index = row * 8 + inverted_col;
    
    // DEBUG: Check if this is GPIO17 (column 7)
    bool is_gpio17 = (matrix_col_pins[col] == GPIO_NUM_17);
    
    int pin_level = gpio_get_level(matrix_col_pins[col]);

    // In simulation mode, use simulated values
    if (simulation_mode) {
      matrix_state[index] = simulation_patterns[current_pattern][index];
    } else {
      // Real hardware: reed switch closed = piece present
      // pin_level == 0 znamená, že column pin je stažený na LOW (figurka je
      // přítomna)
      // NOTE: GPIO17 is configured with pull-down for debug testing
      // Normal logic still applies, but we'll log values for analysis
      matrix_state[index] = (pin_level == 0) ? 1 : 0;
      
      // DEBUG: Minimal logging for GPIO17 (user testing with multimeter)
      // Only log first state change to confirm scanning works
      static int last_gpio17_level = -1;
      static bool gpio17_logged_once = false;
      if (is_gpio17 && !gpio17_logged_once) {
        ESP_LOGI(TAG, "🔍 GPIO17 scan confirmed: row=%d, level=%d (pull-down mode)", row, pin_level);
        gpio17_logged_once = true;
        last_gpio17_level = pin_level;
      } else if (is_gpio17 && last_gpio17_level == -1) {
        last_gpio17_level = pin_level;
      }
    }
  }

  // IMPROVED: Přepni řádek zpět na INPUT po scanování (bezpečnější)
  io_conf.pin_bit_mask = (1ULL << matrix_row_pins[row]);
  io_conf.mode = GPIO_MODE_INPUT;
  gpio_config(&io_conf);

  // Malé čekání před dalším řádkem pro stabilizaci
  esp_rom_delay_us(20); // 20us delay (reduced from 2ms)
#endif
}

// Public function - scans row WITH mutex protection
void matrix_scan_row(uint8_t row) {
  if (row >= 8)
    return;

  // CRITICAL: Protect matrix state with mutex
  if (matrix_mutex != NULL) {
    if (xSemaphoreTake(matrix_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
      matrix_scan_row_internal(row);
      xSemaphoreGive(matrix_mutex);
    } else {
      ESP_LOGW(TAG, "Failed to acquire matrix mutex for scan row");
    }
  } else {
    // Fallback if mutex not available
    matrix_scan_row_internal(row);
  }
}

void matrix_scan_all(void) {
  uint32_t current_time = esp_timer_get_time() / 1000;

  // NOTE: Don't call esp_task_wdt_reset() here because this function
  // is called from timer callbacks which run in timer service task
  // that is not registered with TWDT

  // CRITICAL: Protect matrix state with mutex for change detection
  if (matrix_mutex != NULL) {
    if (xSemaphoreTake(matrix_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
#if CONFIG_CHESS_MATRIX_INPUT_I2C_HALL
      if (simulation_mode) {
        memcpy(matrix_state, simulation_patterns[current_pattern],
               sizeof(matrix_state));
      } else {
        hall_i2c_matrix_fill_state(matrix_state);
      }
#else
      for (int row = 0; row < 8; row++) {
        matrix_scan_row_internal(row);
      }
#endif

      // Detect changes
      for (int i = 0; i < 64; i++) {
        if (matrix_state[i] != matrix_previous[i]) {
          matrix_changes[i] = 1;
        } else {
          matrix_changes[i] = 0;
        }

        // Demo reporting: If anything changed, report activity
        if (matrix_changes[i]) {
          demo_report_activity();
        }
      }

      // CRITICAL: Detect moves BEFORE updating previous state
      // This must be done while we still hold the mutex and before
      // matrix_previous is overwritten, so matrix_detect_moves() can
      // compare matrix_previous with matrix_state
      matrix_detect_moves();

      // Update previous state (AFTER move detection)
      memcpy(matrix_previous, matrix_state, sizeof(matrix_state));

      last_scan_time = current_time;
      scan_count++;

      // NOTE: Don't call WDT reset in timer callback context

      xSemaphoreGive(matrix_mutex);
    } else {
      ESP_LOGW(TAG, "Failed to acquire matrix mutex for scan all");
      return;
    }
  } else {
    // Fallback if mutex not available
#if CONFIG_CHESS_MATRIX_INPUT_I2C_HALL
    if (simulation_mode) {
      memcpy(matrix_state, simulation_patterns[current_pattern],
             sizeof(matrix_state));
    } else {
      hall_i2c_matrix_fill_state(matrix_state);
    }
#else
    for (int row = 0; row < 8; row++) {
      matrix_scan_row_internal(row);
    }
#endif

    for (int i = 0; i < 64; i++) {
      if (matrix_state[i] != matrix_previous[i]) {
        matrix_changes[i] = 1;
      } else {
        matrix_changes[i] = 0;
      }

      // Demo reporting: If anything changed, report activity
      if (matrix_changes[i]) {
        demo_report_activity();
      }
    }

    // CRITICAL: Detect moves BEFORE updating previous state
    // This must be done before matrix_previous is overwritten
    matrix_detect_moves();

