AlfredKrutina/chess_esp32_c6_devkit/components/matrix_task/matrix_task.c
    memcpy(matrix_previous, matrix_state, sizeof(matrix_state));
    last_scan_time = current_time;
    scan_count++;
  }

  if (simulation_mode) {
    ESP_LOGD(TAG, "Matrix scan completed: pattern=%d, changes=%d",
             current_pattern, 0); // Would count changes
  }
}

// ============================================================================
// MOVE DETECTION FUNCTIONS
// ============================================================================

/**
 * @brief Helper function to send PICKUP command to game_command_queue
 * @param square Square index (0-63)
 */
static void matrix_send_pickup_command(uint8_t square) {
  extern QueueHandle_t game_command_queue;

  if (game_command_queue == NULL) {
    ESP_LOGW(TAG,
             "game_command_queue not available - cannot send PICKUP command");
    return;
  }

  char notation[4];
  matrix_square_to_notation(square, notation);

  chess_move_command_t cmd = {
      .type = GAME_CMD_PICKUP,
      .player = 0,           // Will be determined by game task
      .response_queue = NULL // Matrix events don't have response queue
  };
  strncpy(cmd.from_notation, notation, sizeof(cmd.from_notation) - 1);
  cmd.from_notation[sizeof(cmd.from_notation) - 1] = '\0';
  strcpy(cmd.to_notation, "");

  if (xQueueSend(game_command_queue, &cmd, pdMS_TO_TICKS(100)) == pdTRUE) {
    ESP_LOGI(TAG, "PICKUP command sent to game_command_queue: %s", notation);
    // Report activity to HA light task
    ha_light_report_activity("pickup");
  } else {
    ESP_LOGW(TAG, "Failed to send PICKUP command to game_command_queue");
  }
}

/**
 * @brief Helper function to send DROP command to game_command_queue
 * @param square Square index (0-63)
 */
/*
static void matrix_send_drop_command(uint8_t square) {
  extern QueueHandle_t game_command_queue;

  if (game_command_queue == NULL) {
    ESP_LOGW(TAG,
             "game_command_queue not available - cannot send DROP command");
    return;
  }

  char notation[4];
  matrix_square_to_notation(square, notation);

  chess_move_command_t cmd = {
      .type = GAME_CMD_DROP,
      .player = 0,           // Will be determined by game task
      .response_queue = NULL // Matrix events don't have response queue
  };
  strncpy(cmd.to_notation, notation, sizeof(cmd.to_notation) - 1);
  cmd.to_notation[sizeof(cmd.to_notation) - 1] = '\0';
  strcpy(cmd.from_notation, "");

  if (xQueueSend(game_command_queue, &cmd, pdMS_TO_TICKS(100)) == pdTRUE) {
    ESP_LOGI(TAG, "DROP command sent to game_command_queue: %s", notation);
    // Report activity to HA light task
    ha_light_report_activity("drop");
  } else {
    ESP_LOGW(TAG, "Failed to send DROP command to game_command_queue");
  }
}
*/

/**
 * @brief Helper function to send DROP command with from/to notation to
 * game_command_queue
 * @param from_square Source square index (0-63)
 * @param to_square Destination square index (0-63)
 */
static void matrix_send_drop_command_with_from(uint8_t from_square,
                                               uint8_t to_square) {
  extern QueueHandle_t game_command_queue;

  if (game_command_queue == NULL) {
    ESP_LOGW(TAG, "game_command_queue not available - cannot send DROP command "
                  "with from");
    return;
  }

  char from_notation[4], to_notation[4];
  matrix_square_to_notation(from_square, from_notation);
  matrix_square_to_notation(to_square, to_notation);

  chess_move_command_t cmd = {
      .type = GAME_CMD_DROP,
      .player = 0,           // Will be determined by game task
      .response_queue = NULL // Matrix events don't have response queue
  };
  strncpy(cmd.from_notation, from_notation, sizeof(cmd.from_notation) - 1);
  cmd.from_notation[sizeof(cmd.from_notation) - 1] = '\0';
  strncpy(cmd.to_notation, to_notation, sizeof(cmd.to_notation) - 1);
  cmd.to_notation[sizeof(cmd.to_notation) - 1] = '\0';

  if (xQueueSend(game_command_queue, &cmd, pdMS_TO_TICKS(100)) == pdTRUE) {
    ESP_LOGI(TAG, "DROP command with from sent to game_command_queue: %s -> %s",
             from_notation, to_notation);
    // Report activity to HA light task
    ha_light_report_activity("drop");
  } else {
    ESP_LOGW(TAG,
             "Failed to send DROP command with from to game_command_queue");
  }
}

static void matrix_send_guard_command(uint32_t lifted_mask_low,
                                      uint32_t lifted_mask_high,
                                      uint32_t dropped_mask_low,
                                      uint32_t dropped_mask_high,
                                      uint8_t action) {
  extern QueueHandle_t game_command_queue;

  if (game_command_queue == NULL) {
    ESP_LOGW(TAG, "game_command_queue not available - cannot send GUARD command");
    return;
  }

  chess_move_command_t cmd = {
      .type = GAME_CMD_MATRIX_GUARD,
      .player = 0,
      .response_queue = NULL,
  };
  cmd.timer_data.matrix_guard.lifted_mask_low = lifted_mask_low;
  cmd.timer_data.matrix_guard.lifted_mask_high = lifted_mask_high;
  cmd.timer_data.matrix_guard.dropped_mask_low = dropped_mask_low;
  cmd.timer_data.matrix_guard.dropped_mask_high = dropped_mask_high;
  cmd.timer_data.matrix_guard.action = action;
  cmd.from_notation[0] = '\0';
  cmd.to_notation[0] = '\0';

  if (xQueueSend(game_command_queue, &cmd, pdMS_TO_TICKS(100)) == pdTRUE) {
    ESP_LOGW(TAG,
             "MATRIX GUARD command sent: action=%u lifted=%08" PRIx32
             ":%08" PRIx32 " dropped=%08" PRIx32 ":%08" PRIx32,
             (unsigned int)action, lifted_mask_high, lifted_mask_low,
             dropped_mask_high, dropped_mask_low);
  } else {
    ESP_LOGW(TAG, "Failed to send MATRIX GUARD command");
  }
}

void matrix_detect_moves(void) {
  // Check for move timeout - change from RESET to WARNING + EXTEND
  if (last_piece_lifted != 255) {
    uint32_t current_time = esp_timer_get_time() / 1000;
    if (current_time > move_detection_timeout) {
      ESP_LOGW(TAG,
               "⏰ Move taking longer than 5s - piece from %d still in air",
               last_piece_lifted);
      // DON'T reset last_piece_lifted - allow longer moves
      // Just extend timeout to give player more time
      move_detection_timeout = current_time + 5000; // Give another 5 seconds
    }
  }

