AlfredKrutina/chess_esp32_c6_devkit/components/matrix_task/matrix_task.c
  // Collect full delta in this scan to detect ambiguous states.
  uint8_t piece_lifted = 255;
  uint8_t piece_placed = 255;
  uint8_t lift_count = 0;
  uint8_t drop_count = 0;
  uint32_t lifted_mask_low = 0;
  uint32_t lifted_mask_high = 0;
  uint32_t dropped_mask_low = 0;
  uint32_t dropped_mask_high = 0;
  for (int i = 0; i < 64; i++) {
    if (matrix_previous[i] == 1 && matrix_state[i] == 0) {
      lift_count++;
      if (piece_lifted == 255) {
        piece_lifted = i;
      }
      if (i < 32) {
        lifted_mask_low |= (1UL << i);
      } else {
        lifted_mask_high |= (1UL << (i - 32));
      }
    } else if (matrix_previous[i] == 0 && matrix_state[i] == 1) {
      drop_count++;
      if (piece_placed == 255) {
        piece_placed = i;
      }
      if (i < 32) {
        dropped_mask_low |= (1UL << i);
      } else {
        dropped_mask_high |= (1UL << (i - 32));
      }
    }
  }

  // Dvě UP za sebou: normálně ambiguous (matrix guard), ale guided capture
  // (nejdřív oběť, pak útočník) a 3-krokové braní (vlastní → soupeř) to vyžadují.
  bool multi_change = (lift_count > 1) || (drop_count > 1);
  bool pending_lift_and_new_up =
      (last_piece_lifted != 255 && lift_count > 0);
  bool ambiguous_state = multi_change;
  if (!ambiguous_state && pending_lift_and_new_up) {
    if (!(lift_count == 1 && game_matrix_allow_second_sequential_lift())) {
      ambiguous_state = true;
    }
  }

  if (ambiguous_state) {
    if (!matrix_guard_mode_active) {
      // Snapshot expected board occupancy before anomaly.
      memcpy(matrix_guard_expected_state, matrix_previous,
             sizeof(matrix_guard_expected_state));
    }
    matrix_guard_mode_active = true;
    matrix_send_guard_command(lifted_mask_low, lifted_mask_high, dropped_mask_low,
                              dropped_mask_high, 1);
    return;
  }

  if (matrix_guard_mode_active) {
    // Keep matrix flow paused until board occupancy is back to expected state.
    bool back_to_expected =
        (memcmp(matrix_state, matrix_guard_expected_state,
                sizeof(matrix_guard_expected_state)) == 0);
    if (lift_count == 0 && drop_count == 0 && back_to_expected) {
      matrix_guard_mode_active = false;
      matrix_send_guard_command(0, 0, 0, 0, 0);
    }
    return;
  }

  // Process move detection
  if (piece_lifted != 255) {
    last_piece_lifted = piece_lifted;
    move_detection_timeout =
        esp_timer_get_time() / 1000 + 5000; // 5 second timeout

    // Convert square index to row/col
    uint8_t from_row = piece_lifted / 8;
    uint8_t from_col = piece_lifted % 8;

    ESP_LOGI(TAG, "Piece lifted from square %d (%c%d)", piece_lifted,
             'a' + from_col, from_row + 1);

    // UNIFIED FLOW: Send PICKUP command to game_command_queue (same as UART)
    matrix_send_pickup_command(piece_lifted);
  }

  if (piece_placed != 255) {
    last_piece_placed = piece_placed;

    // Convert square index to row/col
    uint8_t to_row = piece_placed / 8;
    uint8_t to_col = piece_placed % 8;

    ESP_LOGI(TAG, "Piece placed on square %d (%c%d)", piece_placed,
             'a' + to_col, to_row + 1);

    // Check if this completes a move
    if (last_piece_lifted != 255) {
      if (last_piece_lifted == piece_placed) {
        // Return to same square - send with from=to
        ESP_LOGI(TAG,
                 "Piece returned to same square - sending DROP with from=to");
        matrix_send_drop_command_with_from(last_piece_lifted, piece_placed);
      } else {
        // Complete move - send with from/to
        matrix_send_drop_command_with_from(last_piece_lifted, piece_placed);
      }
      last_piece_lifted = 255; // Reset
    } else {
      // Piece placed without lift - IGNORE
      ESP_LOGW(TAG, "Piece placed without previous lift (square %d) - ignoring",
               piece_placed);
    }
  }
}

void matrix_detect_complete_move(uint8_t from_square, uint8_t to_square) {
  // Convert square indices to chess notation
  char from_notation[4], to_notation[4];
  matrix_square_to_notation(from_square, from_notation);
  matrix_square_to_notation(to_square, to_notation);

  ESP_LOGI(TAG, "Complete move detected: %d -> %d (%s -> %s)", from_square,
           to_square, from_notation, to_notation);

  // UNIFIED FLOW: Send complete move as DROP with from/to to
  // game_command_queue (same as UART)
  matrix_send_drop_command_with_from(from_square, to_square);
}

// ============================================================================
// UTILITY FUNCTIONS
// ============================================================================

void matrix_square_to_notation(uint8_t square, char *notation) {
  if (square >= 64 || notation == NULL)
    return;

  int row = square / 8;
  int col = square % 8;

  notation[0] = 'a' + col;
  notation[1] = '1' + row;
  notation[2] = '\0';
}

uint8_t matrix_notation_to_square(const char *notation) {
  if (notation == NULL || strlen(notation) != 2)
    return 255;

  char file = tolower(notation[0]);
  char rank = notation[1];

  if (file < 'a' || file > 'h' || rank < '1' || rank > '8') {
    return 255;
  }

  int col = file - 'a';
  int row = rank - '1';

  return row * 8 + col;
}

void matrix_get_state(uint8_t *state_buffer) {
  if (state_buffer == NULL)
    return;

  // Copy current matrix state to buffer
  memcpy(state_buffer, matrix_state, 64);
}

void matrix_print_state(void) {
  ESP_LOGI(TAG, "Matrix State (8x8):");

  for (int row = 7; row >= 0; row--) {
    char line[32] = "";
    char *ptr = line;

    ptr += sprintf(ptr, "%d ", row + 1);

    for (int col = 0; col < 8; col++) {
      int index = row * 8 + col;
      if (matrix_state[index]) {
        ptr += sprintf(ptr, "[P] ");
      } else {
        ptr += sprintf(ptr, "[ ] ");
      }
    }

    ESP_LOGI(TAG, "%s", line);
  }

  ESP_LOGI(TAG, "   a   b   c   d   e   f   g   h");
}

void matrix_test_scanning(void) {
  ESP_LOGI(TAG, "🔍 Testing matrix scanning functionality...");

  // Test 1: Reset matrix state
  ESP_LOGI(TAG, "Test 1: Resetting matrix state");
  matrix_reset();
  matrix_print_state();

  // Test 2: Simulate piece placement
  ESP_LOGI(TAG, "Test 2: Simulating piece placement");
  // Place pieces directly on squares
  matrix_state[1 * 8 + 4] = 1; // e2
  matrix_state[3 * 8 + 4] = 1; // e4
  matrix_state[6 * 8 + 3] = 1; // d7
  matrix_state[4 * 8 + 3] = 1; // d5
  matrix_print_state();

  // Test 3: Simulate piece movement
  ESP_LOGI(TAG, "Test 3: Simulating piece movement");
  matrix_simulate_move("e2", "e4"); // Move from e2 to e4
  matrix_simulate_move("d7", "d5"); // Move from d7 to d5
  matrix_print_state();

