AlfredKrutina/chess_esp32_c6_devkit/components/matrix_task/matrix_task.c
  // Test 4: Simulate piece removal
  ESP_LOGI(TAG, "Test 4: Simulating piece removal");
  // Remove pieces directly from squares
  matrix_state[3 * 8 + 4] = 0; // e4
  matrix_state[4 * 8 + 3] = 0; // d5
  matrix_print_state();

  // Test 5: Test all squares
  ESP_LOGI(TAG, "Test 5: Testing all squares");
  for (int row = 0; row < 8; row++) {
    for (int col = 0; col < 8; col++) {
      // Place piece directly on square
      matrix_state[row * 8 + col] = 1;
      vTaskDelay(pdMS_TO_TICKS(10)); // Small delay
    }
  }
  matrix_print_state();

  // Reset after test
  matrix_reset();
  ESP_LOGI(TAG, "✅ Matrix test completed successfully");
}

void matrix_simulate_move(const char *from, const char *to) {
  uint8_t from_square = matrix_notation_to_square(from);
  uint8_t to_square = matrix_notation_to_square(to);

  if (from_square == 255 || to_square == 255) {
    ESP_LOGE(TAG, "Invalid chess notation: %s -> %s", from, to);
    return;
  }

  ESP_LOGI(TAG, "Simulating move: %s (%d) -> %s (%d)", from, from_square, to,
           to_square);

  // Update matrix state
  matrix_state[from_square] = 0; // Remove piece from source
  matrix_state[to_square] = 1;   // Place piece at destination

  // Force change detection
  matrix_changes[from_square] = 1;
  matrix_changes[to_square] = 1;

  ESP_LOGI(TAG, "Move simulation completed");
}

// ============================================================================
// COMMAND PROCESSING FUNCTIONS
// ============================================================================

void matrix_process_commands(void) {
  uint8_t command;

  // Process commands from queue
  if (matrix_command_queue != NULL) {
    while (xQueueReceive(matrix_command_queue, &command, 0) == pdTRUE) {
      switch (command) {
      case 0: // Reset matrix
        matrix_reset();
        break;

      case 1: // Print state
        matrix_print_state();
        break;

      case 2: // MATRIX_CMD_TEST - Test matrix scanning
        ESP_LOGI(TAG, "=== Matrix Test Started ===");
        matrix_test_scanning();
        ESP_LOGI(TAG, "=== Matrix Test Complete ===");
        break;

      case 3: // Change simulation pattern
        current_pattern = (current_pattern + 1) % 3;
        ESP_LOGI(TAG, "Simulation pattern changed to %d", current_pattern);
        break;

      case 4: // MATRIX_CMD_DISABLE - Disable matrix scanning
        matrix_scanning_enabled = false;
        ESP_LOGI(TAG, "Matrix scanning DISABLED");
        break;

      case 5: // MATRIX_CMD_ENABLE - Enable matrix scanning
        matrix_scanning_enabled = true;
        ESP_LOGI(TAG, "Matrix scanning ENABLED");
        break;

      default:
        ESP_LOGW(TAG, "Unknown matrix command: %d", command);
        break;
      }
    }
  }
}

void matrix_reset(void) {
  ESP_LOGI(TAG, "Resetting matrix state");

  // Clear all states
  memset(matrix_state, 0, sizeof(matrix_state));
  memset(matrix_previous, 0, sizeof(matrix_previous));
  memset(matrix_changes, 0, sizeof(matrix_changes));

  // Reset move detection
  last_piece_lifted = 255;
  last_piece_placed = 255;
  move_detection_timeout = 0;
  matrix_guard_mode_active = false;
  memset(matrix_guard_expected_state, 0, sizeof(matrix_guard_expected_state));

  // Reset scanning
  current_row = 0;
  scan_count = 0;

  ESP_LOGI(TAG, "Matrix reset completed");
}

void matrix_abort_ambiguous_guard_baseline(void) {
  bool gave = false;
  if (matrix_mutex != NULL) {
    if (xSemaphoreTake(matrix_mutex, pdMS_TO_TICKS(300)) == pdTRUE) {
      gave = true;
    } else {
      ESP_LOGW(TAG,
               "matrix_abort_ambiguous: mutex timeout — partial clear (no memcpy)");
    }
  }

  matrix_guard_mode_active = false;
  memset(matrix_guard_expected_state, 0, sizeof(matrix_guard_expected_state));
  last_piece_lifted = 255;
  last_piece_placed = 255;
  move_detection_timeout = 0;

  if (gave) {
    memcpy(matrix_previous, matrix_state, sizeof(matrix_state));
    xSemaphoreGive(matrix_mutex);
  }

  ESP_LOGI(TAG,
           "matrix_abort_ambiguous: local guard off, lift tracking cleared%s",
           gave ? ", baseline synced" : "");
}

// ============================================================================
// TIME-MULTIPLEXING FUNCTIONS
// ============================================================================

/**
 * @brief Uvolni matrix row piny pro button scanning
 *
 * Nastavi vsechny row piny na HIGH (neaktivni stav) aby button task
 * mohl cist column piny bez interference.
 *
 * @details
 * Tato funkce je volana pred button scan window (20-25ms).
 * Vsechny row piny jsou nastaveny na HIGH (pulled up) takze
 * column piny mohou byt bezpecne cteny pro button detection.
 */
void matrix_release_pins(void) {
#if CONFIG_CHESS_MATRIX_INPUT_I2C_HALL
  (void)0;
#else
  for (int row = 0; row < 8; row++) {
    gpio_set_level(matrix_row_pins[row], 1);
  }
#endif
  ESP_LOGD(TAG, "Matrix pins released for button scan");
}

/**
 * @brief Znovu aktivuj matrix row piny pro matrix scanning
 *
 * Obnovi normalni matrix scanning rezim po button scan window.
 *
 * @details
 * Tato funkce je volana po button scan window. Matrix muze pokracovat
 * v normalnim skenovani.
 */
void matrix_acquire_pins(void) {
  // Matrix scanning can resume normally
  // Row pins will be set LOW/HIGH during normal scanning cycle
  ESP_LOGD(TAG, "Matrix pins acquired for matrix scan");

  // No explicit action needed - matrix_scan_all() will handle pins
}

/**
 * @brief Overi zda jsou matrix piny uvolnene
 *
 * @return true pokud jsou vsechny row piny HIGH (uvolnene)
 */
bool matrix_pins_released(void) {
#if CONFIG_CHESS_MATRIX_INPUT_I2C_HALL
  return true;
#else
  for (int row = 0; row < 8; row++) {
    if (gpio_get_level(matrix_row_pins[row]) == 0) {
      return false;
    }
  }
  return true;
#endif
}

// ============================================================================
// MAIN TASK FUNCTION
// ============================================================================

void matrix_task_start(void *pvParameters) {
  ESP_LOGI(TAG, "Matrix task started successfully");

#if CONFIG_CHESS_MATRIX_INPUT_I2C_HALL
  esp_err_t hi = hall_i2c_matrix_init();
  if (hi != ESP_OK) {
    ESP_LOGE(TAG, "Hall I2C init failed: %s — matrix reads budou prázdné",
             esp_err_to_name(hi));
  }
#endif

