AlfredKrutina/chess_esp32_c6_devkit/components/matrix_task/matrix_task.c
#if CONFIG_CHESS_STM32_I2C_BL_ENABLE
  ESP_LOGI(TAG,
           "STM32 I2C bootloader: po I2C init spouštím případný auto-flash "
           "(logy STM32_I2C_BL / STM32_AUTO)");
  stm32_i2c_bl_maybe_auto_flash_on_boot();
#endif

  // CRITICAL: Register with TWDT from within task
  esp_err_t wdt_ret = esp_task_wdt_add(NULL);
  if (wdt_ret != ESP_OK && wdt_ret != ESP_ERR_INVALID_ARG) {
    ESP_LOGE(TAG, "Failed to register Matrix task with TWDT: %s",
             esp_err_to_name(wdt_ret));
  } else {
    ESP_LOGI(TAG, "✅ Matrix task registered with TWDT");
  }

  ESP_LOGI(TAG, "Features:");
  ESP_LOGI(TAG, "  • 8x8 reed switch matrix scanning");
  ESP_LOGI(TAG, "  • Time-multiplexed GPIO control");
  ESP_LOGI(TAG, "  • Move detection and validation");
  ESP_LOGI(TAG, "  • Matrix event generation");
  ESP_LOGI(TAG, "  • Simulation mode (no HW required)");
  ESP_LOGI(TAG, "  • 20ms scan cycle");

  task_running = true;

  // Initialize matrix state
  matrix_reset();

  // Set initial pattern
  current_pattern = 1;

  // Main task loop
  uint32_t loop_count = 0;
  TickType_t last_wake_time = xTaskGetTickCount();

  for (;;) {
    // CRITICAL: Reset watchdog for matrix task in every iteration (only if
    // registered)
    esp_err_t wdt_ret = matrix_task_wdt_reset_safe();
    if (wdt_ret != ESP_OK && wdt_ret != ESP_ERR_NOT_FOUND) {
      // Task not registered with TWDT yet - this is normal during startup
    }

    // Watchdog logging every 500 iterations (5 seconds)
    if (loop_count % 500 == 0) {
      ESP_LOGI(TAG, "Matrix Task Watchdog: loop=%d, heap=%zu", loop_count,
               esp_get_free_heap_size());
    }

    // Process matrix commands
    matrix_process_commands();

    // Matrix scanning is now handled by FreeRTOS timer callback
    // No need to call matrix_scan_all() here to avoid race conditions

    // Periodic status update - reduced frequency for cleaner UART
    if (loop_count % 50000 == 0) { // Every 50000 loops (1000 seconds)
      ESP_LOGI(TAG, "Matrix Task Status: loop=%d, scans=%lu, pattern=%d",
               loop_count, scan_count, current_pattern);

      // Print matrix state occasionally
      if (loop_count % 100000 == 0) {
        matrix_print_state();
      }
    }

    loop_count++;

    // Wait for next cycle (10ms)
    vTaskDelayUntil(&last_wake_time, pdMS_TO_TICKS(10));
  }
}
